In [1]:
import pandas as pd
import numpy as np
import xport as xp

### Demographic

In [5]:
with open('Data/DEMO_C.xpt','rb') as f:
    demoDF = xp.to_dataframe(f)

In [53]:
features = ['SEQN','RIAGENDR','RIDAGEYR','DMDEDUC2','DMDMARTL','DMDHHSIZ','INDFMPIR']

In [54]:
demo = demoDF[features]

In [55]:
demo.head()

      SEQN  RIAGENDR  RIDAGEYR  DMDEDUC2  DMDMARTL  DMDHHSIZ  INDFMPIR
0  21005.0       1.0      19.0       NaN       5.0       2.0      2.44
1  21006.0       2.0      16.0       NaN       5.0       6.0      2.47
2  21007.0       2.0      14.0       NaN       5.0       5.0      1.60
3  21008.0       1.0      17.0       NaN       5.0       7.0      2.75
4  21009.0       1.0      55.0       3.0       1.0       2.0      3.79

In [11]:
from sklearn.preprocessing import LabelEncoder,OneHotEncoder

In [56]:
demo.shape

(10122, 7)

In [57]:
# droping rows with any missing value and compare the shape of the newly obtained dataset:
demo.dropna(axis=0, subset=['RIDAGEYR','DMDEDUC2','DMDMARTL','DMDHHSIZ','INDFMPIR' ], inplace=True)
demo.shape

//anaconda3/lib/python3.7/site-packages/ipykernel_launcher.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/indexing.html#indexing-view-versus-copy

(4722, 7)

In [34]:
demo.shape

(4722, 6)

In [58]:
demo.head()

       SEQN  RIAGENDR  RIDAGEYR  DMDEDUC2  DMDMARTL  DMDHHSIZ  INDFMPIR
4   21009.0       1.0      55.0       3.0       1.0       2.0      3.79
5   21010.0       2.0      52.0       4.0       6.0       3.0      1.24
7   21012.0       1.0      63.0       3.0       6.0       2.0      0.89
10  21015.0       1.0      83.0       4.0       1.0       2.0      1.20
12  21017.0       2.0      37.0       2.0       6.0       2.0      0.21

In [59]:
#DMDEDUC2
demo = demo[demo['DMDEDUC2'] != 7.0]
demo = demo[demo['DMDEDUC2'] != 9.0]

In [60]:
demo.shape

(4714, 7)

In [61]:
#DMDMARTL
demo = demo[demo['DMDMARTL'] != 77.0]
demo = demo[demo['DMDMARTL'] != 99.0]
demo.shape

(4714, 7)

In [62]:
demo.to_csv('dataset/demo.csv')

In [63]:
#gender one hot encoding
y = pd.get_dummies(demo['RIAGENDR'], prefix='gender')
print(y.head())

    gender_1.0  gender_2.0
4            1           0
5            0           1
7            1           0
10           1           0
12           0           1

In [64]:
y['SEQN'] = demo['SEQN']

In [66]:
demo = pd.merge(demo,y,on='SEQN')

In [67]:
demo.head()

,SEQN,RIAGENDR,RIDAGEYR,DMDEDUC2,DMDMARTL,DMDHHSIZ,INDFMPIR,gender_1.0,gender_2.0
0,21009.0,1.0,55.0,3.0,1.0,2.0,3.79,1,0
1,21010.0,2.0,52.0,4.0,6.0,3.0,1.24,0,1
2,21012.0,1.0,63.0,3.0,6.0,2.0,0.89,1,0
3,21015.0,1.0,83.0,4.0,1.0,2.0,1.20,1,0
4,21017.0,2.0,37.0,2.0,6.0,2.0,0.21,0,1

In [69]:
# marital status one hot encoding:
y = pd.get_dummies(demo['DMDMARTL'], prefix='marital')
y['SEQN'] = demo['SEQN']
demo = pd.merge(demo,y,on='SEQN')
demo.head()

,SEQN,RIAGENDR,RIDAGEYR,DMDEDUC2,DMDMARTL,DMDHHSIZ,INDFMPIR,gender_1.0,gender_2.0,marital_1.0,marital_2.0,marital_3.0,marital_4.0,marital_5.0,marital_6.0
0,21009.0,1.0,55.0,3.0,1.0,2.0,3.79,1,0,1,0,0,0,0,0
1,21010.0,2.0,52.0,4.0,6.0,3.0,1.24,0,1,0,0,0,0,0,1
2,21012.0,1.0,63.0,3.0,6.0,2.0,0.89,1,0,0,0,0,0,0,1
3,21015.0,1.0,83.0,4.0,1.0,2.0,1.20,1,0,1,0,0,0,0,0
4,21017.0,2.0,37.0,2.0,6.0,2.0,0.21,0,1,0,0,0,0,0,1

In [70]:
demo.drop(['RIAGENDR','DMDMARTL'],axis=1,inplace = True)
demo.head()

,SEQN,RIDAGEYR,DMDEDUC2,DMDHHSIZ,INDFMPIR,gender_1.0,gender_2.0,marital_1.0,marital_2.0,marital_3.0,marital_4.0,marital_5.0,marital_6.0
0,21009.0,55.0,3.0,2.0,3.79,1,0,1,0,0,0,0,0
1,21010.0,52.0,4.0,3.0,1.24,0,1,0,0,0,0,0,1
2,21012.0,63.0,3.0,2.0,0.89,1,0,0,0,0,0,0,1
3,21015.0,83.0,4.0,2.0,1.20,1,0,1,0,0,0,0,0
4,21017.0,37.0,2.0,2.0,0.21,0,1,0,0,0,0,0,1

In [71]:
demo.to_csv('dataset/demo.csv')

In [72]:
demo.shape

(4714, 13)

### Weight, body measures

In [73]:
with open('Data/BMX_C.xpt','rb') as f:
    BMX = xp.to_dataframe(f)

In [76]:
BMX.shape

(9643, 33)

In [78]:
BMX = BMX[['SEQN','BMXWT','BMXBMI']]

In [83]:
BMX.shape

(9643, 3)

In [84]:
# droping rows with any missing value and compare the shape of the newly obtained dataset:
BMX.dropna(axis=0, inplace=True)
BMX.shape

//anaconda3/lib/python3.7/site-packages/ipykernel_launcher.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/indexing.html#indexing-view-versus-copy

(8687, 3)

In [85]:
BMX.to_csv('dataset/bmx.csv')

### Medication/Supplement

In [86]:
with open('Data/IMQ_C.xpt','rb') as f:
    IMC = xp.to_dataframe(f)

In [89]:
IMC.head()

      SEQN  IMD010  IMQ020  IMQ030
0  21005.0     3.0     3.0     NaN
1  21006.0     3.0     1.0     NaN
2  21007.0     1.0     1.0     NaN
3  21008.0     3.0     1.0     NaN
4  21009.0     3.0     3.0     2.0

In [90]:
IMC = IMC[['SEQN','IMD010','IMQ020']]

In [91]:
IMC.shape

(10122, 3)

In [92]:
IMC.dropna(axis=0, inplace=True)
IMC.shape

//anaconda3/lib/python3.7/site-packages/ipykernel_launcher.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/indexing.html#indexing-view-versus-copy
  """Entry point for launching an IPython kernel.

(9304, 3)

In [93]:
IMC.to_csv('dataset/imc.csv')

In [98]:
IMC.head()

      SEQN  IMD010  IMQ020
0  21005.0     3.0     3.0
1  21006.0     3.0     1.0
2  21007.0     1.0     1.0
3  21008.0     3.0     1.0
4  21009.0     3.0     3.0

In [95]:

IMC.shape

(9304, 3)

In [97]:
#IMD010
IMC = IMC[IMC['IMD010'] != 7.0]
IMC = IMC[IMC['IMD010'] != 9.0]
IMC.shape

(8518, 3)

In [99]:
#IMQ020
IMC = IMC[IMC['IMQ020'] != 7.0]
IMC = IMC[IMC['IMQ020'] != 9.0]
IMC.shape

(8184, 3)

In [100]:
IMC.to_csv('dataset/imc.csv')

### Analgesic Pain Relievers

In [119]:
#RXQANA_C
with open('Data/RXQANA_C.xpt','rb') as f:
    RXQANA = xp.to_dataframe(f)

In [120]:
RXQANA = RXQANA[['SEQN','RXD300']]

In [121]:
RXQANA.shape

(5243, 2)

In [122]:
#RXD300
RXQANA = RXQANA[RXQANA['RXD300'] != 7.0]
RXQANA = RXQANA[RXQANA['RXD300'] != 9.0]
RXQANA.shape

(5231, 2)

In [123]:
#Binary values: yes 1, no 0
RXQANA.replace(to_replace =2.0, value = 0.0, inplace=True)
RXQANA.head()

      SEQN  RXD300
0  21009.0     0.0
1  21010.0     0.0
2  21012.0     1.0
3  21015.0     1.0
4  21015.0     1.0

In [134]:
RXQANA.shape

(5231, 2)

In [135]:
#Droping null values:
RXQANA.dropna(axis=0, inplace=True)
RXQANA.shape

(5223, 2)

In [136]:
RXQANA.to_csv('dataset/RXQANA.csv')

### dietary data

In [125]:
#DSQ1_C
with open('Data/DSQ1_C.xpt','rb') as f:
    DSQ1 = xp.to_dataframe(f)

In [128]:
DSQ1 = DSQ1[['SEQN','DSD010','DSD010AN']]

In [129]:
DSQ1.replace(to_replace =2.0, value = 0.0, inplace=True)

      SEQN  DSD010  DSD010AN
0  21005.0     2.0       2.0
1  21006.0     2.0       2.0
2  21007.0     2.0       2.0
3  21008.0     2.0       2.0
4  21009.0     2.0       2.0

In [130]:
#Binary values: yes 1, no 0
DSQ1.replace(to_replace =2.0, value = 0.0, inplace=True)
DSQ1.head()

//anaconda3/lib/python3.7/site-packages/pandas/core/frame.py:4042: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/indexing.html#indexing-view-versus-copy
  method=method)

      SEQN  DSD010  DSD010AN
0  21005.0     0.0       0.0
1  21006.0     0.0       0.0
2  21007.0     0.0       0.0
3  21008.0     0.0       0.0
4  21009.0     0.0       0.0

In [131]:
DSQ1.shape

(10122, 3)

In [132]:
#Droping null values:
DSQ1.dropna(axis=0, inplace=True)
DSQ1.shape

//anaconda3/lib/python3.7/site-packages/ipykernel_launcher.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/indexing.html#indexing-view-versus-copy
  """Entry point for launching an IPython kernel.

(10108, 3)

In [137]:
DSQ1.to_csv('dataset/DSQ1.csv')

## Bad Habits:

### Alcohol consumption

In [160]:
with open('Data/ALQ_C.xpt','rb') as f:
    ALQ = xp.to_dataframe(f)

In [161]:
ALQ = ALQ[['SEQN','ALQ120Q','ALQ120U']]

In [162]:
ALQ.shape

(4742, 3)

In [163]:
ALQ.dropna(axis = 0,inplace = True)
ALQ.shape

(2695, 3)

In [164]:
ALQ.head()

       SEQN  ALQ120Q  ALQ120U
1   21010.0      7.0      1.0
4   21017.0      3.0      3.0
5   21018.0      4.0      3.0
8   21029.0      3.0      2.0
11  21034.0      2.0      1.0

In [165]:
#ALQ120Q
ALQ = ALQ[ALQ['ALQ120Q'] !=777]
ALQ = ALQ[ALQ['ALQ120Q'] !=999]

In [166]:
ALQ.shape

(2695, 3)

In [167]:
ALQ_Year = []
for index, row in ALQ.iterrows():
    if row['ALQ120U'] == 1.0:
            ALQ_Year.append(row['ALQ120Q'] * 52)
    elif row['ALQ120U'] == 2.0:
            ALQ_Year.append(row['ALQ120Q'] * 12)
    elif row['ALQ120U'] == 3.0:
            ALQ_Year.append(row['ALQ120Q'])

In [168]:
ALQ['ALQ_Year'] = ALQ_Year

In [169]:
ALQ = ALQ[['SEQN','ALQ_Year']]

In [170]:
ALQ.head()

       SEQN  ALQ_Year
1   21010.0     364.0
4   21017.0       3.0
5   21018.0       4.0
8   21029.0      36.0
11  21034.0     104.0

In [171]:
ALQ.to_csv('dataset/alq.csv')

In [172]:
ALQ.shape

(2695, 2)

### Smoking

In [173]:
with open('Data/SMQ_C.xpt','rb') as f:
    SMQ = xp.to_dataframe(f)

In [177]:
SMQ = SMQ[['SEQN','SMQ020']]

In [179]:
SMQ.dropna(axis=0,inplace = True)

//anaconda3/lib/python3.7/site-packages/ipykernel_launcher.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/indexing.html#indexing-view-versus-copy
  """Entry point for launching an IPython kernel.

In [180]:
SMQ.shape

(5040, 2)

In [181]:
SMQ = SMQ[SMQ['SMQ020'] != 7]
SMQ = SMQ[SMQ['SMQ020'] != 9]
SMQ.shape

(5035, 2)

In [194]:
SMQ.replace(to_replace =2.0, value = 0.0, inplace=True)
SMQ.head()

      SEQN  SMQ020
0  21009.0     0.0
1  21010.0     1.0
2  21012.0     1.0
3  21015.0     1.0
4  21017.0     1.0

In [183]:
SMQ.to_csv('dataset/SMQ.csv')

#### Household smoking

In [2]:
with open('Data/SMQFAM_C.xpt','rb') as f:
    FAMSMQ = xp.to_dataframe(f)

In [3]:
FAMSMQ = FAMSMQ[['SEQN','SMD410','SMD415']]

In [4]:
FAMSMQ.head()

      SEQN  SMD410  SMD415
0  21005.0     2.0     NaN
1  21006.0     1.0     1.0
2  21007.0     1.0     1.0
3  21008.0     1.0     1.0
4  21009.0     2.0     NaN

In [5]:
FAMSMQ1 = FAMSMQ[['SEQN','SMD410']]
FAMSMQ2 = FAMSMQ[['SEQN','SMD415']]

In [6]:
FAMSMQ1.replace(to_replace = 2.0,value = 0.0,inplace = True)
FAMSMQ1.head()

//anaconda3/lib/python3.7/site-packages/pandas/core/frame.py:4042: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/indexing.html#indexing-view-versus-copy
  method=method)

      SEQN  SMD410
0  21005.0     0.0
1  21006.0     1.0
2  21007.0     1.0
3  21008.0     1.0
4  21009.0     0.0

In [7]:
FAMSMQ = pd.merge(FAMSMQ1,FAMSMQ2,on='SEQN')
FAMSMQ.head()

      SEQN  SMD410  SMD415
0  21005.0     0.0     NaN
1  21006.0     1.0     1.0
2  21007.0     1.0     1.0
3  21008.0     1.0     1.0
4  21009.0     0.0     NaN

In [8]:
# replacing null values from the variable:
#"SMD415 - Total number of smokers in home" if the variable "SMD410 - Does anyone smoke in the home"
# is zero!!

In [9]:
for index, row in FAMSMQ.iterrows():
    if row['SMD410'] == 0:
            row['SMD415'] = 0

In [10]:
FAMSMQ.shape

(10122, 3)

In [11]:
FAMSMQ.dropna(axis=0,inplace=True)
FAMSMQ.shape

(9980, 3)

In [209]:
FAMSMQ = FAMSMQ[['SMD415']]

In [210]:
FAMSMQ.to_csv('dataset/FAMSMQ.csv')

### Drug use:

In [212]:
with open('Data/DUQ_C.xpt','rb') as f:
    DUQ =xp.to_dataframe(f)

In [214]:
DUQ = DUQ[['SEQN','DUQ100']]

In [215]:
DUQ.shape

(2992, 2)

In [216]:
DUQ.dropna(axis=0,inplace=True)
DUQ.shape

(2641, 2)

In [217]:
DUQ.replace(to_replace = 2.0,value = 0.0, inplace = True)
DUQ.head()

      SEQN  DUQ100
0  21009.0     0.0
1  21010.0     0.0
2  21017.0     0.0
3  21018.0     0.0
4  21019.0     0.0

In [218]:
DUQ = DUQ[DUQ['DUQ100'] != 7]
DUQ = DUQ[DUQ['DUQ100'] != 9]
DUQ.shape

(2632, 2)

In [219]:
DUQ.to_csv('dataset/DUQ.csv')

### TV/PC watch/use time:

In [221]:
with open('Data/PAQ_C.xpt','rb') as f:
    PAQ = xp.to_dataframe(f)

In [224]:
PAQ = PAQ[['SEQN','PAD590','PAD600']]

In [225]:
PAQ.shape

(9278, 3)

In [227]:
PAQ.dropna(axis=0,inplace=True)
PAQ.shape

(9197, 3)

In [228]:
PAQ.head()

      SEQN  PAD590  PAD600
0  21005.0     3.0     2.0
1  21006.0     4.0     0.0
2  21007.0     3.0     1.0
3  21008.0     3.0     6.0
4  21009.0     1.0     2.0

In [229]:
# removing useless values:
PAQ = PAQ[PAQ['PAD590'] !=77]
PAQ = PAQ[PAQ['PAD590'] !=99]
PAQ = PAQ[PAQ['PAD600'] !=77]
PAQ = PAQ[PAQ['PAD600'] !=99]
PAQ.shape

(9192, 3)

In [230]:
#shifting all the values by 1 and assigning 0 to subject who answered None:
for index, row in PAQ.iterrows():
    if row['PAD590'] == 6:
            row['PAD590'] = 0
    else:
        row['PAD590'] += 1
for index, row in PAQ.iterrows():
    if row['PAD600'] == 6:
            row['PAD600'] = 0
    else:
        row['PAD600'] += 1

In [231]:
PAQ.head()

      SEQN  PAD590  PAD600
0  21005.0     4.0     3.0
1  21006.0     5.0     1.0
2  21007.0     4.0     2.0
3  21008.0     4.0     0.0
4  21009.0     2.0     3.0

In [232]:
PAQ.to_csv('dataset/PAQ.csv')

### Social involvement:

In [233]:
with open ('Data/SSQ_C.xpt','rb') as f:
    SSQ = xp.to_dataframe(f)

In [236]:
SSQ = SSQ[['SEQN','SSQ061','SSQ011','SSQ051']]

In [237]:
SSQ.shape

(3299, 4)

In [238]:
SSQ.dropna(axis = 0, inplace=True)
SSQ.shape

(3299, 4)

In [241]:
#Deleting missing values
SSQ = SSQ[SSQ['SSQ061'] != 7777]
SSQ = SSQ[SSQ['SSQ061'] != 9999]

SSQ = SSQ[SSQ['SSQ011'] != 7]
SSQ = SSQ[SSQ['SSQ011'] != 9]

SSQ = SSQ[SSQ['SSQ051'] != 7]
SSQ = SSQ[SSQ['SSQ051'] != 9]
SSQ.shape

(3124, 4)

In [242]:
SSQ.head()

      SEQN  SSQ061  SSQ011  SSQ051
0  21009.0    25.0     1.0     1.0
1  21010.0    10.0     1.0     1.0
2  21012.0     1.0     1.0     1.0
3  21015.0    10.0     1.0     1.0
4  21019.0     5.0     1.0     1.0

In [243]:
SSQ1 = SSQ[['SEQN','SSQ011','SSQ051']]
SSQ2 = SSQ[['SEQN','SSQ061']]

In [245]:
SSQ1.replace(to_replace = 2.0,value = 0, inplace = True)

In [247]:
SSQ = pd.merge(SSQ2,SSQ1,on='SEQN')

In [249]:
SSQ.shape

(3124, 4)

In [250]:
#removing values 3 for SSQ011 and SSQ051:

SSQ = SSQ[SSQ['SSQ011'] != 3]

SSQ = SSQ[SSQ['SSQ051'] != 3]
SSQ.shape

(3014, 4)

In [251]:
SSQ.to_csv('dataset/SSQ.csv')

### Hospital Utilization

In [272]:
with open ('Data/HUQ_C.xpt','rb') as f:
    HUQ = xp.to_dataframe(f)

In [273]:
HUQ = HUQ[['SEQN','HUQ010']]

In [274]:
HUQ.shape

(10122, 2)

In [275]:
HUQ.dropna(axis=0,inplace=True)
HUQ.shape

(10122, 2)

In [276]:
HUQ = HUQ[HUQ['HUQ010'] != 7]
HUQ = HUQ[HUQ['HUQ010'] != 9]
HUQ.shape

(10118, 2)

In [277]:
HUQ.head()

      SEQN  HUQ010
0  21005.0     3.0
1  21006.0     2.0
2  21007.0     2.0
3  21008.0     2.0
4  21009.0     2.0

In [278]:
HUQ.to_csv('dataset/HUQ.csv')